OpenFOAM/montana-v2106/run/icoFoam/cavity3/cavity/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
       // type            inletOutlet;
       //  inletValue           uniform 0;

        type            fixedValue;
        value           uniform 0;
    }
/*
    symmetry
    {
        //type            symmetry;
                type            zeroGradient;

    }
*/
    fixedWalls
    {
        type            zeroGradient;
    }

    potentialWallTop   // treated same as fixedWalls
    {
        type            zeroGradient;
       //   type            inletOutlet;
       //  inletValue           uniform 0;
    }


    potentialWallBot   // treated same as fixedWalls
    {
        type            zeroGradient;
       // type            fixedValue;
        //value           uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
